#include <stdio.h>
// #include <stdlib.h>
// #include <math.h>

int main(void)
{
    int N, i, j;
    // double temp;
    scanf("%d", &N);

    // for (i=1, count =0; i<=N; i++){
    //     // printf("현재 %d\n", i);
    //     for(j=1, temp=0; j*j<=i; j++)
    //     {
    //         if(i%j==0){
    //             // printf("-- %d, %d는 약수 --\n", j, i/j);
    //             if(j == i/j)
    //                 temp += 1;
    //             else
    //                 temp += 2;
    //         }
    //     }
    //     // printf("약수 개수는 %d개\n", temp);
    //     if(temp%2 == 1)
    //         count++;
    //     // printf("\n");
    // }

    // for (i=1, count=0; i*i<=N; i++)
    // {
    //     if(i*i <= N)
    //         count++;
    // }
    // //진쟈 개에바

    for (i=1; i*i<=N; i++);
    // //진쟈 개갸갞에바


    printf("%d\n", i-1);


    // int* flags = (int*)malloc(sizeof(int)*N);
    // for(i=0; i<N; i++)
    //     flags[i] = 0;
    // for(i=1; i<=N; i++){
    //     for(j=1; i*j<=N; j++)
    //         flags[i*j-1] = !flags[i*j-1];
    //     for(i=0; i<N; i++)
    //         printf("%d ", flags[i]);
    //     printf("\n");
    // }
    // for(i=0, count=0; i<N; i++)
    //     if(flags[i])
    //         count++;
    // printf("%d\n", count);



    // 청색부터 시작
    // 백색이 위로 놓여진 깃발의 수
    // 1~N까지, 매 번 1~N배수의 깃발을 뒤집기

    // 1 : 백, 0 : 청

    // 0 0 0 0 0
    // 1 1 1 1 1
    // 1 0 1 0 1
    // 1 0 0 0 1
    // 1 0 0 1 1
    // 1 0 0 1 1


    // 0 0 0 0 0 0 0 0 0 0
    // 1 1 1 1 1 1 1 1 1 1
    // 1 0 1 0 1 0 1 0 1 0
    // 1 0 0 0 1 1 1 0 0 0
    // 1 0 0 1 1 1 1 1 0 0
    // 1 0 0 1 1 1 1 1 0 1
    // 1 0 0 1 1 0 1 1 0 1
    // 1 0 0 1 1 0 0 1 0 1
    // 1 0 0 1 1 0 0 0 0 1
    // 1 0 0 1 1 0 0 0 1 1
    // 1 0 0 1 1 0 0 0 1 0 - 4개...


    // 10 - 1:10, 2:5, 3:3, 4:2, 5:1, 6:1, 7:1, 8:1, 9:1, 10:1
    // +10 -5 +3 -2 +1 -1 +1 -1 +1 -1 = 

    // 01 의 약수 1개 : 홀수 : 백
    // 02 의 약수 2개 : 짝수 : 청
    // 03 의 약수 2개 : 짝수 : 청
    // 04 의 약수 3개 : 홀수 : 백
    // 05 까지의 배수 2개 : 짝수 : 청
    // 06 까지의 배수 4개 : 짝수 : 청
    // 07 까지의 배수 2개 : 짝수 : 청
    // 08 까지의 배수 
    // 09 
    // 10 
    // 


    // printf("%d\n", );
    return 0;
}